Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/disablement_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Disablement Benefit is a benefit under the Occupational Injuries Scheme
ga: Is íocaíocht faoin Scéim um Shochair Dhíobhálacha Ceirde é Sochar Míthreorach

source: It can be paid to you if you suffer a loss of physical or mental faculty because of an accident at work, an accident travelling directly to or from work, or a prescribed disease contracted at work
ga: Is féidir é a íoc leat má chailleann tú cunas fisiciúil nó meabhrach de bharr timpiste a tharla agus tú ag obair, timpiste a tharla agus tú ag dul go dtí nó abhaile ó obair nó de bharr galair a bhuail thú ag obair

source: Payment is only made where the level of disablement following the accident or disease is assessed at 15% or more
ga: Íoctar é má mheastar go bhfuil míchumas 15% nó níos mó i ndiaidh an timpiste

source: Where the level of disablement is assessed at 20% or more the benefit is paid by weekly or 4-weekly pension (called Disablement Pension)
ga: Íoctar Sochar Míthreorach i bhfoirm cnapshuime, áfach, má mheastar go bhfuil míchumas 20% nó níos lú i gceist

source: However, where the rate is assessed at less than 20%, the benefit is paid as a lump sum (called Disablement Gratuity).The size of the lump sum will vary depending on the degree of disablement and how long you are reasonably expected to be disabled
ga: Beidh éagsúlacht ag baint le méid na cnapshuime ag brath ar a mhíchumasaithe is atá tú agus cá fhad a bhfuiltear ag súil go réasúnach go mbeidh tú míchumasaithe

source: If you are getting Disablement Benefit and you are unfit for work, you may qualify for Illness Benefit based on your social insurance contributions (PRSI)
ga: Má tá Sochar Míthreorach dhá íoc leat agus muna bhfuil tú in ann dul ag obair, b'fhéidir go mbeadh Sochar Breoiteachta le fáil agat bunaithe ar do chuid ÁSPC

source: If you do not qualify for Illness Benefit or another social welfare payment, you may get Incapacity Supplement
ga: Muna bhfuil tú i dteideal Sochair Breoiteachta b'fhéidir go mbeadh Forlíonadh Éagumais ag dul duit

source: This is an extra supplement with Disablement Pension. You may get Incapacity Supplement if you are permanently incapable of work as a result of an occupational accident or disease and do not qualify for another social welfare payment such as Illness Benefit. You may get an increase in your payment for an adult dependant and child dependants
ga: Seo íocaíocht bhreise a mhéadaíonn an Sochar Míthreorach do dhuine nuair a ghlactar leis nach bhfuil sé/sí in ann dul i mbun oibre agus nach mbeidh feasta de bharr timpiste/galair shaothair agus nuair nach bhfuil an duine i dteideal aon íocaíochta leasa shóisialaigh, mar shampla Sochar Breoiteachta

source: Incapacity Supplement is not payable outside the EU. If you do not qualify for a State Pension at age 66, you can remain on Incapacity Supplement
ga: Íoctar liúntais bhreise ar son daoine fásta cleithiúnacha nó páistí cleithiúnacha atá cáilithe

source: This allowance can be paid weekly as an increase to Disablement Pension if you are so seriously disabled as to need someone (a relative or some other person) to help you daily at home to attend to your personal needs for a period of at least 6 months
ga: Is féidir an liúntas seo a íoc go seachtainiúil mar ardú ar an tSochar Míthreorach má tá tú chomh dona faoi mhíchumas agus go mbíonn duine éigin (gaol nó duine eile) ag teastáil chun cuidiú leat agus aire phearsanta a thabhairt duit go laethúil ar feadh tréimhse 6 mhí ar a laghad

source: You must be getting a Disablement Pension of 50% or over
ga: Caithfidh Sochar Míthreorach de 50% nó níos mó a bheith dhá íoc leis an duine

source: Entitlement to Constant Attendance Allowance is based on the recommendation of the Department’s medical advisor
ga: Bíonn teidlíocht ar Liúntas Freastail Leanúnaigh bunaithe ar mholadh chomhairleoir liachta na Roinne

source: You will not get the allowance during any period you are in a hospital or similar institution. Constant Attendance Allowance is not payable outside the EU
ga: Ní bhfaighidh tú an liúntas i rith aon tréimhse go mbíonn tú in ospidéal nó in institiúid cosúil leis

source: Disablement Benefit, Incapacity Supplement and Constant Attendance Allowance are taxable sources of income but you are unlikely to pay tax if they are your only income. Disablement Gratuity is not taxable
ga: Má cheapann tú go bhfuil éagóir déanta mar gheall go bhfuil Sochar Míthreorach diúltaithe duit, nó má tá tú míshásta le cinneadh a thóg Oifigeach Leasa Shóisialaigh maidir lena bhfuil tú ina theideal, tá an rogha agat achomharc a lorg maidir leis an gcinneadh seo

source: You may get Disablement Benefit if you suffer a loss of physical or mental faculty because of:
ga: Beidh tú cáilithe chun Sochar Mithreorach a fháil má tá tú tar éis cumais fhisiciúla nó mheabhrach a chailliúint mar gheall ar:

source: • An accident at work
ga: • Timpiste le linn do chuid oibre,

source: • An accident while travelling (on an unbroken journey) directly to or from work
ga: • Timpiste taistil ar bhealach díreach idir d'áit chónaithe agus d'áit oibre

source: • A prescribed occupational disease
ga: • Galar forordaithe a thóg tú le linn do chuid oibre

source: Loss of physical or mental faculty
ga: Cailliúint chumais fisiciúil nó meabhrach

source: The extent of disablement is assessed following an examination by a Medical Assessor who will assess the extent of your loss of faculty as a result of your occupational accident or disease
ga: Déanfar measúnú ar Mhéid an Éagumais tar éis scrúdaithe a dhéanann Meastóir Leighis. Déanfaidh sé/sí measúnú ar mhéid an chumais a chaill tú de bharr do thimpiste/do ghalair shaothair

source: 'Loss of faculty' means your inability to enjoy a normal lifestyle because of the loss or partial loss of your ordinary physical or mental abilities as a result of your occupational injury or disease
ga: Ciallaíonn "cailliúint chumais" do neamhábaltacht gnáth shaol a chaitheamh, mar gheall gur chaill tú cuid nó iomlán d'éirim mheabhrach nó fhisiciúil mar thoradh ar ghortú / ar ghalar saothair

source: In assessing the degree of loss of faculty, account is taken of how your current physical and mental condition compares to your pre-accident state of health and how you compare with a healthy person of the same age and sex
ga: Nuair atá measúnú á dhéanamh ar chailliúint chumais, déantar comparáid idir an gcruth fisiciúil agus meabhrach atá ort anois agus an cruth a bhí ort roimh an timpiste agus freisin cé chomh sláintiúil agus atá tú le hais duine sláintiúil den aois agus den ghnéas céanna leat féin

source: Examples of assessments are as follows:
ga: Seo a leanas samplaí de mheasúnaithe:

source: │Loss of both hands │100% │
ga: Cailliúint dhá lámh 100%

source: │Loss of one eye │40% │
ga: Cailliúint súil amháin 40%

source: │Loss of 2 fingers of one hand │20% │
ga: Cailliúint 2 mhéar ar lámh amháin 20%

source: In order to qualify for Disablement Benefit, you must have been in employment on or after 1 May 1967, that was insurable at PRSI Class A, B, D, J or M, at the time that you sustained the accident or disease
ga: Chun a bheith ina theideal caithfidh tú a bheith i bhfostaíocht faoi árachas ag ÁSPC in Aicmí A, B, D, J nó M

source: (Under the Occupational Injuries Scheme, civil servants insured at PRSI Class B are not eligible for Disablement Benefit for the first 26 weeks after the date of the accident
ga: (Faoin Scéim um Shochair Dhíobhálacha Ceirde níl Sochar Míthreorach ar fáil do státseirbhísigh atá faoi árachas ÁSPC in Aicme B don chéad 26 seachtainí tar éis dáta na timpiste

source: This is because for this 26 week period, civil servants continue to be paid by their parent Department
ga: Sin é an cúis a bhfuil a dtuarastal á íoc ag an bPríomhroinn le linn an tréimse 26 seachtaini

source: After this 26-week period, a civil servant is paid half their salary and half-rate Disablement Benefit)
ga: Ní íocfar Sochar Míthreorach leo i ndiaidh na tréimhse seo ach ag leath an ráta agus bíonn an leath eile á íoc ag an bPríomhroinn nó ag an eagraíocht stáit atá bainteach.)

source: Declaring an occupational injury
ga: Ag dearbhú díobhála ceirde

source: All work accidents or occupational diseases may not result immediately in illness or disablement
ga: Ní gá i gcónaí go dtiocfadh tinneas/míchumas ar dhuine láithreach tar éis timpiste/galair shaothair

source: If you are not immediately incapacitated but wish to safeguard your future right to Disablement Benefit, you should notify your employer about the accident or disease and apply for a declaration that your accident or disease was an occupational one
ga: Muna bhfuil tú éagumasaithe láithreach ach go dteastaíonn uait a bheith cinnte go mbeidh Sochar Míthreorach ar fáil duit amach anseo má tá gá leis, ba cheart duit do fhostóir a chur ar an eolas faoin timpiste/faoin ngalar agus iarratas a dhéanamh ar dhearbhú gur timpiste/galar saothair a bhí i gceist

source: This should be done without delay
ga: Ba cheart é seo a dhéanamh gan mhoill

source: Declaration forms are available from the Injury Benefit Section of Department of Social Protection (see 'Where to apply' below)
ga: Tá na foirmeacha dearbhaithe ar fáil ón Rannóg Sochair Díobhála, Roinn Coimirce Sóisialaí - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: If your disablement occurs at a later stage, you should claim within 3 months of becoming aware of it
ga: Má tharlaíonn an t-éagumas níos déanaí, ba cheart duit iarratas a chur isteach, taobh istigh de 3 mhí ón am a dtugann tú faoi deara é

source: Your payment depends on the degree of your disablement, which is medically assessed
ga: Braitheann an íocaíocht a fhaigheann tú ar mhéid an éagumais atá i gceist agus cuirfear scrúdú dochtúra ort chun é seo a mheas

source: For assessments of less than 20%, Disablement Benefit will normally be a lump sum (gratuity)
ga: Más measúnú atá níos lú ná 20% atá i gceist is iondúil go n-íoctar é seo ina chnapshuim (deolchaire)

source: The size of the lump sum will vary depending on the degree of disablement and how long you are expected to be disabled
ga: Braithfidh méid na cnapshuime ar mhéid an éagumais atá i gceist agus cén t-achar a cheaptar a leanfaidh an t-éagumas

source: For assessments of 20% upwards, a pension is payable
ga: Má tá measúnú de 20% nó níos mó i gceist íocfar pinsean

source: From 17 March 2017, if you have 100% disablement, your maximum personal pension is €224 (previously €219)
ga: Má tá do mhíthreoir 100%, beidh d'uasráta pinsean pearsanta €224.00

source: A lump sum may be payable, up to a maximum of €15,670 (previously €15,320)
ga: Ó Eanáir 2011, d'fhéadfaí cnapshuim suas go dtí uasmhéid €15,670 a bheith iníoctha

source: If you have between 20-90% disablement, your maximum personal pension is as follows:
ga: Má tá do mhíthreoir idir 20% agus 90%, beidh d'uasráta pinsean pearsanta mar a leanas

source: │disablement│to 17 March │17 March │ │ │2017, € │2017, € │
ga: │Leibhéal Míthreor │Rata seachtainiúil ó 17 Márta 2017 │

source: Up to 19% disablement:
ga: Éagumas suas go dtí 19%:

source: A lump sum may be payable
ga: D'fhéadfaí cnapshuim a bheith iníoctha

source: │Weekly rate in 2016 and up to 17 March 2017 │Under 66, € │Over 66, € │
ga: Ráta seachtainiúil (ó 17 Márta 2017)

source: │Increase for a Qualified Child │29.80 │29.80 │
ga: │Cleithiúnaí Linbh │€29.80 │

source: • €205 in 2016 and up to 17 March 2017 • €210 from 17 March 2017
ga: Tá ráta seachtainiúil Liúntas Freastail Leanúnaigh €210.00 ó 17 Márta 2017

source: This payment is only made to certain people with over 50% disablement
ga: Níl sé íoctha amháin do dhaoine le míthreor os cionn 50%

source: If you are unable to work after the accident or disease, you should first claim Injury Benefit, which can be paid for up to 26 weeks after the accident or the onset of the disease
ga: Muna bhfuil tú in ann dul i mbun oibre tar éis na timpiste/an ghalair, ba cheart duit ar dtús éileamh a dhéanamh ar Shochar Díobhála, gur féidir a fháil ar feadh suas le 26 seachtainí tar éis na timpiste nó an ama a thagann an galar ort

source: Before your Injury Benefit payment finishes, you should claim Disablement Benefit if you suffer from loss of faculty as a result of your accident or disease
ga: Sula dtagann deireadh leis an íocaíocht ar Shochar Díobhála ba cheart duit éileamh a dhéanamh ar Shochar Míthreorach mas rud é gur chaill tú cumas de bharr do thimpiste nó do ghalair

source: If you do not claim in time, you may lose some benefit
ga: Muna ndéanann tú éileamh in am d’fhéadfá cuid den sochar a chailliúint

source: You should claim within 3 months of your Injury Benefit claim ending
ga: Ba cheart an t-éileamh a dhéanamh taobh istigh de 3 mhí ón am a thagann deireadh leis an íocaíocht ar Shochar Díobhála

source: If you are able to work after the accident or disease, you should claim Disablement Benefit as soon as possible and within 3 months of the date of the accident or the onset of the disease
ga: Muna bhfuil tú in ann dul i mbun oibre tar éis na timpiste/an ghalair, ba cheart duit éileamh a dhéanamh ar Shochar Míthreorach chomh luath agus is féidir leat agus taobh istigh de 3 mhí ón am ar tharla an timpiste nó ón am ar tháinig an galar ort

source: Payment is made from the fourth day of your disablement
ga: Déantar an íocaíocht ón gceathrú lá i ndiaidh na míchumasaíochta a theacht ort

source: You should claim within 3 months of the date of your accident or the onset of the disease
ga: Ba cheart an t-éileamh a dhéanamh taobh istigh de 3 mhí ón am ar tharla an timpiste nó ón am ar thosaigh an galar

source: To apply fill in a Disablement Benefit claim form (pdf) and send it to the address below
ga: Chun d'iarratas a dhéanamh déan an fhoirm éilimh OB 21 a íoschóipeáil agus a chomhlánú (pdf) agus seol é ar ais chuig an seoladh thíos

source: If you think you have been wrongly refused Disablement Benefit, or you are unhappy about a decision of a Social Welfare Deciding Officer about your entitlements, you can appeal this social welfare decision
ga: Cá háit a ndeánfaidh mé iarratas?

source: Your completed application form should be returned to Disablement Benefit Section below
ga: Ba chóir d’fhoirm iarratais chomhlánaithe a sheoladh chuig an Rannóg Sochar Míthreorach thíos

source: For more information on Disablement Benefit, contact your Intreo Centre or Social Welfare Branch Office or the Disablement Benefit Section
ga: Le haghaidh tuilleadh eolais maidir le Sochar Míthreorach, déan teagmháil leis an Ionad Intreo ó d'Oifig Bhrainse Leasa Shóisialaigh nó leis an Rannóg Sochar Míthreorach
